project-description.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+TITLE: Project Description
#+DATE: <2018-07-01 Sun>
#+AUTHOR: Milo Cress
#+EMAIL: milo@archlinux
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.1 (Org mode 9.1.6)

* TODO Problem
  As computer graphics advance in processing power, the visual detail that graphics processors can render also increases, requiring a larger amount of data to render. The goal of this project is to explore on-the-fly creation of 3-dimensional rendering data, which would limit the amount of data required to render a scene by generating visually relevant areas at a higher level of detail than non-visually relevant areas. While traditional models are stored at a consistent level of detail throughout the scene, this project attempts to create models that comprise only a fraction of the scene, but relative to the viewer, appear to comprise the entire scene.
* TODO Solution Prototype
  This project uses procedural terrain generation that functions on a variety of spatial and temporal scales, at a realistic level of detail. It is divided into two parts: the sector event buffer, and the Sector Tree.
  Implementation of procedural terrain generation with fixed geometries and Levels of Detail, as well as simulation of natural events such as erosion, continental drift, etc.
** TODO Coordinate System
   #+BEGIN_SRC haskell :tangle myworld/src/Coordinate.hs
     module Coordinate where

     data Coordinate = Planar { x_coord :: Double
                              , y_coord :: Double }
                     | Spherical { latitude  :: Double
                                 , longitude :: Double }
                     | Cubic { x_coord :: Double,
                               y_coord :: Double,
                               z_coord :: Double
                             }

     newtype Transform = Transform { runTransform :: Coordinate -> Coordinate }
   #+END_SRC
