project-description.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-20 Fri 00:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project Description</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Milo Cress" />
</head>
<body>
<div id="content">
<h1 class="title">Project Description</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9efdd15">1. <span class="todo TODO">TODO</span> Problem</a></li>
<li><a href="#org4a163b7">2. <span class="todo TODO">TODO</span> Solution</a>
<ul>
<li><a href="#orgd8814e1">2.1. <span class="todo TODO">TODO</span> Mapping System</a></li>
<li><a href="#org0629902">2.2. <span class="todo TODO">TODO</span> Sector Tree</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9efdd15" class="outline-2">
<h2 id="org9efdd15"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Problem</h2>
<div class="outline-text-2" id="text-1">
<p>
As computer graphics advance in processing power, the visual detail that graphics processors can render also increases, requiring a larger amount of data to render. The goal of this project is to explore on-the-fly creation of 3-dimensional rendering data, which would limit the amount of data required to render a scene by generating visually relevant areas at a higher level of detail than non-visually relevant areas. While traditional models are stored at a consistent level of detail throughout the scene, this project attempts to create models that comprise only a fraction of the scene, but relative to the viewer, appear to comprise the entire scene.
</p>
</div>
</div>
<div id="outline-container-org4a163b7" class="outline-2">
<h2 id="org4a163b7"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Solution</h2>
<div class="outline-text-2" id="text-2">
<p>
This project uses procedural terrain generation that functions on a variety of spatial and temporal scales, at a realistic level of detail. It is divided into two parts: the sector event buffer, and the Sector Tree.
</p>
</div>
<div id="outline-container-orgd8814e1" class="outline-3">
<h3 id="orgd8814e1"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Mapping System</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Implementation of procedural terrain generation with fixed geometries and Levels of Detail, as well as simulation of natural events such as erosion, continental drift, etc.
</p>

<p>
