project-description.html
We will use the programming language, Haskell, to prototype our system:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">Map</span> <span style="color: #4f97d7; font-weight: bold;">where</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #ce537a; font-weight: bold;">Data.Functor.Identity</span>

<span style="color: #4f97d7; font-weight: bold;">data</span> <span style="color: #ce537a; font-weight: bold;">Coordinate</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Planar</span> <span style="color: #4f97d7;">{</span> x_coord <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Double</span>
                         , y_coord <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #4f97d7;">}</span>
                <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">Spherical</span> <span style="color: #4f97d7;">{</span> x_coord <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Double</span>
                            , y_coord <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">newtype</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> m a <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> <span style="color: #4f97d7;">{</span> runMapT <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Coordinate</span> <span style="color: #7590db;">-&gt;</span> m a <span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">instance</span> <span style="color: #ce537a; font-weight: bold;">Functor</span> m <span style="color: #7590db;">=&gt;</span> <span style="color: #ce537a; font-weight: bold;">Functor</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">MapT</span> m<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">where</span>
  fmap f x <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> <span style="color: #7590db;">$</span> <span style="color: #7590db;">\</span>p <span style="color: #7590db;">-&gt;</span> fmap f <span style="color: #4f97d7;">(</span> runMapT x p <span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">instance</span> <span style="color: #ce537a; font-weight: bold;">Applicative</span> m <span style="color: #7590db;">=&gt;</span> <span style="color: #ce537a; font-weight: bold;">Applicative</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">MapT</span> m<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">where</span>
  f <span style="color: #7590db;">&lt;*&gt;</span> x <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> <span style="color: #7590db;">$</span> <span style="color: #7590db;">\</span>p <span style="color: #7590db;">-&gt;</span> runMapT f p <span style="color: #7590db;">&lt;*&gt;</span> runMapT x p
  pure  x <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> <span style="color: #7590db;">$</span> <span style="color: #7590db;">\</span><span style="color: #4f97d7; font-weight: bold;">_</span> <span style="color: #7590db;">-&gt;</span> pure x

<span style="color: #4f97d7; font-weight: bold;">instance</span> <span style="color: #ce537a; font-weight: bold;">Monad</span> m <span style="color: #7590db;">=&gt;</span> <span style="color: #ce537a; font-weight: bold;">Monad</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">MapT</span> m<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">where</span>
  <span style="color: #4f97d7;">(</span><span style="color: #7590db;">&gt;&gt;=</span><span style="color: #4f97d7;">)</span>  <span style="color: #7590db;">=</span> bind
  return <span style="color: #7590db;">=</span> unit

<span style="color: #bc6ec5; font-weight: bold;">bind</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Monad</span> m <span style="color: #7590db;">=&gt;</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> m a <span style="color: #7590db;">-&gt;</span> <span style="color: #4f97d7;">(</span>a <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> m b<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> m b
<span style="color: #bc6ec5; font-weight: bold;">bind</span> x f <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> <span style="color: #7590db;">$</span> <span style="color: #7590db;">\</span>p <span style="color: #7590db;">-&gt;</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  pointAttr <span style="color: #7590db;">&lt;-</span> runMapT x p
  runMapT <span style="color: #4f97d7;">(</span> f pointAttr <span style="color: #4f97d7;">)</span> p

<span style="color: #bc6ec5; font-weight: bold;">unit</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Monad</span> m <span style="color: #7590db;">=&gt;</span> a <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> m a
<span style="color: #bc6ec5; font-weight: bold;">unit</span> x <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> <span style="color: #7590db;">$</span> <span style="color: #7590db;">\</span><span style="color: #4f97d7; font-weight: bold;">_</span> <span style="color: #7590db;">-&gt;</span> return x

<span style="color: #4f97d7; font-weight: bold;">instance</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Applicative</span> m, <span style="color: #ce537a; font-weight: bold;">Num</span> a<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">=&gt;</span> <span style="color: #ce537a; font-weight: bold;">Num</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">MapT</span> m a<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">where</span>
  a <span style="color: #7590db;">+</span> b <span style="color: #7590db;">=</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">+</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&lt;$&gt;</span> a <span style="color: #7590db;">&lt;*&gt;</span> b
  a <span style="color: #7590db;">-</span> b <span style="color: #7590db;">=</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">-</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&lt;$&gt;</span> a <span style="color: #7590db;">&lt;*&gt;</span> b
  a <span style="color: #7590db;">*</span> b <span style="color: #7590db;">=</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">*</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&lt;$&gt;</span> a <span style="color: #7590db;">&lt;*&gt;</span> b
  abs a <span style="color: #7590db;">=</span> abs <span style="color: #7590db;">&lt;$&gt;</span> a
  signum a <span style="color: #7590db;">=</span> signum <span style="color: #7590db;">&lt;$&gt;</span> a
  fromInteger <span style="color: #7590db;">=</span> pure <span style="color: #7590db;">.</span> fromInteger

<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Height</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Double</span>
<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Heightmap</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Map</span> <span style="color: #ce537a; font-weight: bold;">Height</span>
<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Map</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> <span style="color: #ce537a; font-weight: bold;">Identity</span>

<span style="color: #bc6ec5; font-weight: bold;">runMap</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Map</span> a <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Coordinate</span> <span style="color: #7590db;">-&gt;</span> a
<span style="color: #bc6ec5; font-weight: bold;">runMap</span> m p <span style="color: #7590db;">=</span> runIdentity <span style="color: #4f97d7;">(</span>runMapT m p<span style="color: #4f97d7;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5;">{-# LANGUAGE LambdaCase #-}</span>
<span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">MapExamples</span> <span style="color: #4f97d7; font-weight: bold;">where</span>

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #ce537a; font-weight: bold;">Map</span>

<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">MaybeHeightmap</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> <span style="color: #ce537a; font-weight: bold;">Maybe</span> <span style="color: #ce537a; font-weight: bold;">Height</span>

<span style="color: #bc6ec5; font-weight: bold;">flatMap</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">MaybeHeightmap</span>
<span style="color: #bc6ec5; font-weight: bold;">flatMap</span> <span style="color: #7590db;">=</span> return <span style="color: #a45bad;">1.0</span>

<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">The unit declaration above is synonymous with the following, but more readable (and therefore preferred):</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">flatMap = Map $ \_ -&gt; Just 1.0</span>

<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">Any calls to getPointAttr of flatMap will return 1.0 -- this is the most basic and simple kind of map.</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">Ex:</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">getPointAttr flatMap (Planar 1 2)</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">getPointAttr flatMap (Spherical Infinity 0.0)</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">As we can see, unit declarations don't sanity-check inputs, but don't need to. They can take any input.</span>

<span style="color: #bc6ec5; font-weight: bold;">bumpyMap</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">MaybeHeightmap</span>
<span style="color: #bc6ec5; font-weight: bold;">bumpyMap</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> <span style="color: #7590db;">$</span> <span style="color: #7590db;">\</span><span style="color: #4f97d7; font-weight: bold;">case</span>
  <span style="color: #ce537a; font-weight: bold;">Planar</span> x y <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Just</span> <span style="color: #7590db;">$</span> sin x <span style="color: #7590db;">*</span> cos y
  <span style="color: #4f97d7; font-weight: bold;">_</span>          <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Nothing</span>

<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">Note that since bumpyMap works around the Maybe monad, it's possible for the function to fail, such as when</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">it's applied to a coordinate that is non-planar.</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">Richer monadic wrappers can result in more expressive error messages, such as (Left "spherical coordinates not</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">supported" -- a result of the Either monad).</span>
<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">MaybeHeightmap'</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Either</span> <span style="color: #ce537a; font-weight: bold;">String</span><span style="color: #4f97d7;">)</span> <span style="color: #ce537a; font-weight: bold;">Height</span>

<span style="color: #bc6ec5; font-weight: bold;">bumpyMap'</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">MaybeHeightmap'</span>
<span style="color: #bc6ec5; font-weight: bold;">bumpyMap'</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">MapT</span> <span style="color: #7590db;">$</span> <span style="color: #7590db;">\</span><span style="color: #4f97d7; font-weight: bold;">case</span>
  <span style="color: #ce537a; font-weight: bold;">Planar</span> x y <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Right</span> <span style="color: #7590db;">$</span> sin x <span style="color: #7590db;">*</span> cos y
  <span style="color: #4f97d7; font-weight: bold;">_</span>          <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Left</span> <span style="color: #2d9574;">"Spherical coordinates not supported"</span>

<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">Now, we can use monadic binding to compose maps! Yay!</span>
<span style="color: #bc6ec5; font-weight: bold;">flatAndBumpy</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">MaybeHeightmap</span>
<span style="color: #bc6ec5; font-weight: bold;">flatAndBumpy</span> <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  h  <span style="color: #7590db;">&lt;-</span> flatMap
  h' <span style="color: #7590db;">&lt;-</span> bumpyMap
  return <span style="color: #7590db;">$</span> h <span style="color: #7590db;">+</span> h'
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">This is remarkably compact syntax compared to a non-monadic style, and forms the basis for the implementation</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">of the Num typeclass (the Num implementation has since been rewritten to use the more succinct Applicative</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">syntax, but it is easy to imagine how Num could be written with monads).</span>

<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">instance (Monad m, Num a) =&gt; Num (MapT m a) where</span>
<span style="color: #2aa1ae; background-color: #292e34;">--   </span><span style="color: #2aa1ae; background-color: #292e34;">a + b = do</span>
<span style="color: #2aa1ae; background-color: #292e34;">--     </span><span style="color: #2aa1ae; background-color: #292e34;">v  &lt;- a</span>
<span style="color: #2aa1ae; background-color: #292e34;">--     </span><span style="color: #2aa1ae; background-color: #292e34;">v' &lt;- b</span>
<span style="color: #2aa1ae; background-color: #292e34;">--     </span><span style="color: #2aa1ae; background-color: #292e34;">return $ v + v'</span>
<span style="color: #2aa1ae; background-color: #292e34;">--   </span><span style="color: #2aa1ae; background-color: #292e34;">...</span>
<span style="color: #2aa1ae; background-color: #292e34;">--   </span><span style="color: #2aa1ae; background-color: #292e34;">abs a = do</span>
<span style="color: #2aa1ae; background-color: #292e34;">--     </span><span style="color: #2aa1ae; background-color: #292e34;">v &lt;- a</span>
<span style="color: #2aa1ae; background-color: #292e34;">--     </span><span style="color: #2aa1ae; background-color: #292e34;">return $ abs v</span>
<span style="color: #2aa1ae; background-color: #292e34;">--   </span><span style="color: #2aa1ae; background-color: #292e34;">fromInteger = return . fromInteger</span>

<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">These expressions become even more powerful when used to transform types. For example, imagine that a</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">topographical map (hMap :: heightmap), a roughness map (rMap :: MapT Maybe Double), and a wetmap (wMap :: MapT</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">Maybe Bool) are to be displayed by a program as an image, using the red, green, and blue channels to indicate</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">elevation, roughness, and water distribution, respectively. A simple color library exists which has the type</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">constructor:</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">RGB :: Double -&gt; Double -&gt; Double -&gt; Color</span>
<span style="color: #4f97d7; font-weight: bold;">data</span> <span style="color: #ce537a; font-weight: bold;">Color</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">RGB</span> <span style="color: #4f97d7;">{</span> red <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Double</span>, blue <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Double</span>, green <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">In order to display the map, we need to convert the heightmap to a Color map.</span>
<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Colormap</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Map</span> <span style="color: #ce537a; font-weight: bold;">Color</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">We can use monads for this!</span>
<span style="color: #bc6ec5; font-weight: bold;">toColorMap</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Heightmap</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Map</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Map</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Colormap</span>
<span style="color: #bc6ec5; font-weight: bold;">toColorMap</span> hMap rMap wMap <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">do</span>
  height    <span style="color: #7590db;">&lt;-</span> hMap
  roughness <span style="color: #7590db;">&lt;-</span> rMap
  wetness   <span style="color: #7590db;">&lt;-</span> wMap
  <span style="color: #4f97d7; font-weight: bold;">let</span> w_val <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">if</span> wetness <span style="color: #4f97d7; font-weight: bold;">then</span> <span style="color: #a45bad;">1</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #a45bad;">0</span>
    <span style="color: #4f97d7; font-weight: bold;">in</span> return <span style="color: #7590db;">$</span> <span style="color: #ce537a; font-weight: bold;">RGB</span> height roughness w_val

<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">We can also use applicatives.</span>
<span style="color: #bc6ec5; font-weight: bold;">toColorMap'</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Heightmap</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Map</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Map</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Colormap</span>
<span style="color: #bc6ec5; font-weight: bold;">toColorMap'</span> hMap rMap wMap <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">RGB</span> <span style="color: #7590db;">&lt;$&gt;</span> hMap <span style="color: #7590db;">&lt;*&gt;</span> rMap <span style="color: #7590db;">&lt;*&gt;</span> fmap <span style="color: #4f97d7;">(</span><span style="color: #7590db;">\</span>x <span style="color: #7590db;">-&gt;</span> <span style="color: #4f97d7; font-weight: bold;">if</span> x <span style="color: #4f97d7; font-weight: bold;">then</span> <span style="color: #a45bad;">1</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #a45bad;">0</span><span style="color: #4f97d7;">)</span> wMap
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">While the monadic version is the more readable of the two (but not by a large margin), the applicative version</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">is far more succinct.</span>
</pre>
</div>
</div>
</div>
