project-description.org
** TODO Maps to Images
   #+BEGIN_SRC haskell :tangle ./myworld/src/PixelMap.hs
     module PixelMap where

     import Codec.Picture.Types
     import Data.Array.Repa
     import Map
     import Coordinate
     import Data.Functor.Identity

     type RGB8     = (Pixel8, Pixel8, Pixel8)
     type PixelMap = Map PixelRGB8

     type RGBMap   = Map RGB8

     toPixel :: RGB8 -> PixelRGB8
     toPixel (r, g, b) = PixelRGB8 r g b

     fromPixelMap :: PixelMap -> (Double -> Double -> Coordinate) -> Int -> Int -> Image PixelRGB8
     fromPixelMap m f = generateImage $ \x y -> runMap m $ f (fromIntegral x) (fromIntegral y)
     -- f is a constructor for Coordinate.

     fromRGBMap :: RGBMap -> (Double -> Double -> Coordinate) -> Int -> Int -> Image PixelRGB8
     fromRGBMap  m f w h = fromArrToImg . unboxArr $ fromMapToArr m f w h

     unboxArr :: Array D DIM2 RGB8 -> Array U DIM2 RGB8
     unboxArr = runIdentity . computeUnboxedP

     fromMapToArr :: RGBMap -> (Double -> Double -> Coordinate) -> Int -> Int -> Array D DIM2 RGB8
     fromMapToArr m f w h = fromFunction (Z :. w :. h) $ \(Z :. x :. y) ->
       runMap m $ f (fromIntegral x) (fromIntegral y)

     fromArrToImg :: Array U DIM2 RGB8 -> Image PixelRGB8
     fromArrToImg a =
       let (Z :. w :. h) = extent a
       in generateImage (\x y -> toPixel $ a ! (Z :. x :. y)) w h
   #+END_SRC
** TODO Sector Tree
   Implementation of a =SectorTree=, along with code that divides sectors into smaller child sectors, as well as control code that decides how/when to expand or prune branches of the sector tree.
   #+BEGIN_SRC haskell
   #+END_SRC

** Stack Setup
   #+BEGIN_SRC haskell :tangle ./myworld/app/Main.hs
     module Main where

     import PixelMap
     import Map
     import Coordinate
     import Codec.Picture.Types
     import Codec.Picture
     import Data.Complex

     file :: String
     file = "./map.png"

     main :: IO ()
     -- main = savePngImage file $ ImageRGB8 $ fromPixelMap m_mand Planar 1920 1080
     main = savePngImage file . ImageRGB8 $ fromRGBMap m_mand' Planar 1920 1080

     gradient :: PixelMap
     gradient = MapT $ \(Planar x y) -> return $ PixelRGB8 (mod (floor x) 255) (mod (floor y) 255) 255

     m_mand :: PixelMap
     m_mand = mandelmap 1000 $ Transform $ \(Planar x y) -> Planar (x / 600 - 2) (y / 600 - (1080/1200))

     mandelmap :: Int -> Transform -> PixelMap
     mandelmap n xform = MapT $ \p -> return $
       let (Planar x y) = runTransform xform p
           z            = x :+ y
       in if mandelbrot z z n then black else white

     mandelbrot :: Complex Double -> Complex Double -> Int -> Bool
     mandelbrot z _ _ | (sqr $ realPart z) + (sqr $ imagPart z) > 4 = False where sqr a = a * a
     mandelbrot _ _ i | i <= 0 = True
     mandelbrot z c i = mandelbrot (z*z + c) c (i - 1)

     black :: PixelRGB8
     black = PixelRGB8 0 0 0

     white :: PixelRGB8
     white = PixelRGB8 255 255 255

     mandelmap' :: Int -> Transform -> RGBMap
     mandelmap' n xform = MapT $ \p -> return $
       let (Planar x y) = runTransform xform p
           z                = x :+ y
       in if mandelbrot z z n then black' else white'

     black' :: RGB8
     black' = (0, 0, 0)

     white' :: RGB8
     white' = (255, 255, 255)

     m_mand' :: RGBMap
     m_mand' = mandelmap' 1000 $ Transform $ \(Planar x y) -> Planar (x / 600 - 2) (y / 600 - (1080/1200))
   #+END_SRC
