project-description.tex

\subsection{{\bfseries\sffamily TODO} Sector Tree}
\label{sec:org569f2ce}
Implementation of a \texttt{SectorTree}, along with code that divides sectors into smaller child sectors, as well as control code that decides how/when to expand or prune branches of the sector tree.
\end{document}
